%*******************************************************************
%程序：EX607.M
%功能：灰阶强度图像显示灰度颜色表
%*******************************************************************
figure                       %创建图形对象
subplot(2,2,1)            %子图设置
A=ones(100,50);          
imagesc(A,[0 1]);colormap(gray)    %设置颜色表
title('1在gray颜色表中代表白色')     %为当前图像设置标题
subplot(2,2,2)                           %子图设置
B=zeros(100,50);         
imagesc(B,[0 1]);colormap(gray)     %设置颜色表
title('0在gray颜色表中代表黑色')      %为当前图像设置标题
subplot(2,1,2)                           %字图设置
C=randn(200,50);            
imagesc(C);colormap(gray)            %设置颜色表
title('正态分布的二维图像显示')         %为当前图像设置标题
