%********************************************************
%程序：EX624.M
%功能：把一幅真彩色图像转换为一个YCbCr模型空间对应的图像
%********************************************************
RGB=imread('pic001.jpg');    %将图像格式文件读入为MATLAB图像对象数组数据
YCbCr=rgb2ycbcr(RGB);         %真彩色图像RGB转换为YCbCr空间中的图像YCBCR
subplot(1,2,1);                 %子图设置
subimage(RGB);                  %子图像显示
title('原图像');                 %为当前图像添加标题
subplot(1,2,2);                %子图设置
subimage(YCbCr);               %子图像显示
title('变换后的图像');          %为当前图像设置标题
