%************************************************
%程序：EX409.M
%功能：不指定颜色索引数组的映射索引着色
%***********************************************
[x1,y1]=meshgrid(-1:0.1:0);     %设置三维网格矩阵
z1=zeros(size(x1));                %定义z1为矩阵x1的均匀分布伪随机数     
 [x2,y2]=meshgrid(0:0.1:1);      %设置三维网格矩阵
z2=ones(size(x2));                 %定义z2为矩阵x2的均匀分布伪随机数  
x=[x1 x2];y=[y1 y2];z=[z1 z2];
surf(x,y,z)                          %绘制网格曲面图
colormap(cool)                      %设置其颜色表
colorbar                              %为当前图形添加颜色条
