%************************************************************
%程序：EX305.M
%功能：网格曲面图绘制应用实例
%***********************************************************
x=-8:0.5:8;               %定义x坐标轴范围及刻度
y=x;                        %设置y与x之间的函数关系
[X,Y]=meshgrid(x,y);   %设置矩形网络
R=sqrt(X.^2+Y.^2)+eps;  %函数关系
Z=sin(R)./R;                %函数关系
mesh(X,Y,Z)                 %绘制网格曲面
grid on                       %绘制网格  
axis([-10 10 -10 10 -1 1 ])  %坐标轴范围参数调整
Xlabel('x')                  %设置x坐标轴标注
Ylabel('y')                   %设置y坐标轴标注
Zlabel('z')                   %设置z坐标轴标注
