%********************************************************
%程序：EX202-2.M
%功能：高级绘图函数plot绘图实例
%********************************************************
x=0:0.4*pi:2*pi;                %定义x坐标轴范围及刻度
y1=sin(x);                        %定义y1与x函数关系
y2=cos(x);                        %定义y2与x函数关系
y3=sin(x-0.1*pi);               %定义y3与x函数关系
y4=cos(x+0.1*pi);               %定义y4与x函数关系
plot(x,y1,x,y2,x,y3,x,y4)	%图2-3，注意比较和图2-2的不同
title('Plot绘图结果 ')          %图形名称标注
xlabel('x','FontSize',15)    %坐标轴名称标注
ylabel('y','FontSize',8)	%坐标轴名称标注
