%********************************************************
%程序：EX214.M
%功能：坐标轴标注函数text使用实例
%********************************************************
x=0:pi/100:2*pi;                           %定义x坐标轴范围及刻度
y=sin(x);                                    %定义y与x之间的函数关系
plot(x,y)                                    %绘制函数图形
axis([0 2*pi -1.5 1.5])                  %调整坐标轴范围参数
line([0,2*pi],[0,0])                     %绘制水平线
text(0.5,0.85, 'sin(x) ','sc')      %在图形上置添加文字
text(0.5*pi,0.5, 'position')           %在图形上置添加文字
text(1.5*pi, -0.5, 'negative')       %在图形上置添加文字
