%********************************************************
%程序：EX220.M
%功能：子图函数subplot使用实例
%********************************************************
 x=-6:0.1:6;         %定义x坐标轴范围及刻度
 y1=x;                 %定义y1与x函数关系
 y2=x.^2;             %定义y2与x函数关系
 y3=x.^3;              %定义y3与x函数关系
 y4=x.^4;              %定义y4与x函数关系
 subplot(2,2,1)      %子图设置
 plot(x,y1)           %绘制图形
 title('y1=x')   	%给当前图形添加标题
 subplot(2,2,2)      %设置子图
plot(x,y2)             %绘制图形
 title('y2=x^2')     %图形添加标题
 subplot(2,2,3)      %子图设置
 plot(x,y3)            %绘制图形       
 title('y3=x^3')     %给当前图形添加标题
 subplot(2,2,4)      %子图设置
 plot(x,y4)           %绘制图形
 title('y4=x^4')    %给当前图形添加标题
