%********************************************************
%程序：EX222.M
%功能：对数/半对数坐标系绘制使用实例
%********************************************************
 t=0:0.01*pi:2*pi;                      %定义坐标轴t的范围及刻度
x=0:0.01:10;                             %定义x坐标轴范围及刻度
y=exp(-x);                                %定义y与x之间的函数关系
subplot(2,2,1)                           %设置子图
plot(x,y,'r')                            %绘制图形
title('plot')                             %为当前图形添加标题
subplot(2,2,2)                            %设置子图
semilogx(x,y,'--k')                     %x轴采用对数刻度的半对数坐标系图形
title('semilogx')                        %为当前图形添加标题
subplot(2,2,3)                            %设置子图
semilogy(x,y,'-.g','LineWidth',2)   %y轴采用对数刻度的半对数坐标系图形
title('semilogy')                         %为当前图形添加标题
subplot(2,2,4)                             %设置子图
loglog(x,y,':b','LineWidth',0.5')    %x和y轴都采用对数刻度的半对数坐标系图形
title('loglog')                            %为当前图形添加标题
