%********************************************************
%程序：EX621.M
%功能：利用warp函数将一幅真彩图像映射到球面上
%********************************************************
RGB1=imread('circles.jpg');
RGB2=imread('tree.jpg');
I1=imread('horse.jpg');
I2=imread('leaf.jpg');       %将图像格式文件读入为MATLAB图像对象数组数据
subplot(2,2,1);                %子图设置
subimage([0,500],[0,500],RGB1);    %子图像显示
subplot(2,2,2)                          %子图设置
subimage([0,500],[0,500],RGB2);   %子图像显示
subplot(2,2,3)                         %子图设置
subimage([0,500],[0,500],I1);      %子图像显示
subplot(2,2,4)                         %子图设置
subimage([0,500],[0,500],I2);     %子图像显示
