%************************************************************
%程序：EX303.M
%功能：坐标标记函数使用实例
%***********************************************************
t=0:pi/50:8*pi;      %通过meshgrid创建网格数据
x=sin(t);              %定义x与t之间的函数关系
y=cos(t);              %定义y与t之间的函数关系
z=t;                    %定义z与t之间的函数关系
plot3(x,y,z)          %绘制x、y、z三维图形
xlabel('x=sin(t) ') %设置x坐标轴标注
ylabel('y=cos(t) ') %设置y坐标轴标注
zlabel('z=t')         %设置z坐标轴标注
title('三维螺旋线')   %设置图形标注
Xlabel('x')          %设置x坐标轴标注
Ylabel('y')         %设置y坐标轴标注
Zlabel('z')         %设置z坐标轴标注
