%************************************************************
%程序：EX306.M
%功能：三维网格图应用实例
%***********************************************************
 [X,Y] = meshgrid(-3:.5:3); %设置矩形网络
Z = 2*X.^2-3*Y.^2;            %定义z与x、y之间的函数关系
subplot(2,2,1)                 %设置子图
plot3(X,Y,Z)                    %绘制图形
title('plot3')                  %为当前图形添加标题
subplot(2,2,2)                  %子图设置
mesh(X,Y,Z)                      %绘制网格曲面
title('mesh')                   %为当前图形添加标题
subplot(2,2,3)                   %子图设置
meshc(X,Y,Z)                      %绘图的同时，在x-y平面上绘制函数的等值线
title('meshc')                  %为当前图形添加标题
subplot(2,2,4)                  %子图设置
meshz(X,Y,Z)                    %在网格图基础上在图形的底部外侧绘制平行z轴的边框线
title('meshz')                 %为当前图形添加标题
