%**************************************************************
%程序：EX307.M
%功能：隐藏线显示与关闭实例
%**************************************************************
x=-8:0.5:8;                   %定义x坐标轴范围及刻度
y=x;                            %定义y与x之间的函数关系
[X,Y]=meshgrid(x,y);        %设置矩形网格
R=sqrt(X.^2+Y.^2)+eps;     %定义函数关系
Z=sin(R)./R;                  %定义函数关系
subplot(1,2,1)               %子图设置
mesh(X,Y,Z)                   %绘制网格曲面
hidden on                     %保持图形
grid on                         %添加网格
title('hidden on')           %为当前图形添加标题
axis([-10 10 -10 10 -1 1])  %坐标轴范围参数调整
Xlabel('x')                      %设置x坐标轴标示
Ylabel('y')                      %设置y坐标轴标示
Zlabel('z')                      %设置z坐标轴标示
subplot(1,2,2)                  %子图设置
mesh(X,Y,Z)                      %绘制网格曲面
hidden off                       %关闭图形保持
grid on                           %添加网格
title('hidden off')           %为当前图形添加标题
axis([-10 10 -10 10 -1 1])  %坐标轴范围参数调整
Xlabel('x')                      %设置x坐标轴标注
Ylabel('y')                      %设置y坐标轴标注
Zlabel('z')                      %设置z坐标轴标注
