%*********************************************************
%程序：EX308.M
%功能：阴影曲面绘制函数surf使用实例
%*********************************************************
x=-8:0.5:8;                 %定义x坐标轴范围及参数
y=x;                          %定义y与x之间的函数关系
[X,Y]=meshgrid(x,y);     %设置矩形网络
R=sqrt(X.^2+Y.^2)+eps;   %设置函数关系
Z=2*sin(R)./R;              %设置函数关系
surf(X,Y,Z)                  %绘制阴影曲面图
grid on                       %添加网格
axis([-10 10 -10 10 -0.5 1.5]) %坐标轴范围参数调整
shading shading                    %设置阴影效果
Xlabel('x')                  %设置x坐标轴标注
Ylabel('y')                 %设置y坐标轴标注
Zlabel('z')                %设置z坐标轴标注
