%**********************************************
%程序：EX319.M
%功能：三维绘图函数绘制三维图形
%**********************************************
subplot(2,2,1)                                           %子图设置
ezplot3('sin(t)','cos(t)','sin(2*t)',[0,2*pi]) %绘制三维图形
subplot(2,2,2)                                           %子图设置
ezmesh(@peaks,[-5 5 -5 5])                            %绘制网线图
subplot(2,2,3)                                           %子图设置
ezsurf(@(x,y)(x.^2+y.^2),[-5 5 -5 5])            %绘制表面图
subplot(2,2,4)                                           %子图设置
ezsurfc(@(x,y)(x.^2+y.^2),[-5 5 -5 5])           %回至表面图，并且在x-y平面叠加绘制等高线
