%******************************************************
%程序：EX317.M
%功能：曲面及其对应的三维等高线的绘制
%******************************************************
x=-3:0.25:3;            %定义x坐标轴取值范围及刻度
y=x;                      %定义y与x函数关系
[X,Y]=meshgrid(x,y);  %设置矩形网格
Z=3*(1-X).^2.*exp(-(X.^2)-(Y+1).^2)-10*(X/5-X.^3-Y.^5).*exp(-X.^2-Y.^2)
  -1/3*exp(-(X+1).^2-Y.^2);      %定义函数关系
subplot(2,2,1)                      %子图设置
mesh(X,Y,Z)                          %绘制网格曲面图
xlabel('x')                          %设置x坐标轴标注
ylabel('y')                          %设置y坐标轴标注
zlabel('Z')                          %设置z坐标轴标注
title('Peaks函数图形')            %为当前图形添加标题
subplot(2,1,2)                     %子图设置
[c,h]=contour3(x,y,Z);          %绘制三维等高线
clabel(c,h)                        %标记等高线的数值
xlabel('x')                        %设置x坐标轴标注
ylabel('y')                        %设置y坐标轴标注                    
zlabel('z')                        %设置z坐标轴标注
title('Peaks函数的三维等高线')
