%********************************************************
%程序：EX219.M
%功能：叠加绘图函数hold使用实例
%********************************************************
 x=-5:5;                     %定义x坐标轴范围
 y1=randn(size(x));        %定义函数关系
y2=normpdf(x);              %定义函数关系
 subplot(2,1,1)             %设置子图
hold                           %保持图形       
plot(x,y1,'b')               %绘制图形
hold 
plot(x,y2,'r' )	       %新的绘图指令冲掉了原来的绘图结果
 title('hold off mode')   %图形标题标注
 subplot(2,1,2)             %设置字图
 hold on	                   %打开子图2的叠加绘图模式
 plot(x,y1,'b')             %绘制图形
 plot(x,y2,'r')	     %新的绘图结果碟架在原来的图形中
 title('hold on mode')    %图形标题标注
