%********************************************************
%程序：EX216.M
%功能：为图形添加图例
%********************************************************
x=0:0.01*pi:4*pi;             %定义x坐标轴范围及定义
y1=2*sin(x);                   %定义y1与x之间的函数关系
y2=cos(x);                      %定义y2与x之间的函数关系
y3=sin(2*x).*cos(x);         %定义y3与x之间的函数关系
plot(x,[y1;y2;y3])            %绘制图形
axis([0 4*pi -2 2.5])        %调整坐标轴范围参数
set(gca,'XTick',[0 pi 2*pi],'XTickLabel',{'0','pi','2pi'})
legend('2*sin(x)','cos(x)','sin(2x)cos(x)')   %添加图例
