%********************************************************
%程序：EX228.M
%功能：火柴杆图绘制函数stem使用实例
%********************************************************
t=0:0.2:10;                     %定义t的范围及刻度
y=exp(-0.5*t).*sin(7*t);    %定义y与t之间的函数关系
subplot(2,1,1)                 %子图设置
stem(t,y)                        %绘制火柴杆图形
hold on                           %保持图形
plot(t,y)                        %绘制普通二维图形
plot(t,y,'r')                  %绘制二维图形
xlabel('X')
ylabel('Y')
subplot(2,1,2)                  %子图设置
stem(t,y,'-.dg','fill')     %绘制火柴杆图形
xlabel('X')
ylabel('Y')


