%****************************************************
%程序：EX506.M
%功能：利用电影方式显示动画
%****************************************************
[x,y,z]=peaks(30);            %产生peaks数据              
surf(x,y,z);                    %绘制三维网格曲面
set(gca, 'visible','off'); %将图轴关闭以免发生图轴一起旋转而产生混淆的情况
colormap(hot)                  %设置颜色表
shading interp                  %设置阴影效果
for i=1:15                    % 记录电影，旋转并记录每一个画面
view(-45+15*(i-1),30)      %视角的改变
m(:,i)=getframe;           %抓取画面值并加到绘图窗口的画面矩阵中
end
movie(m)                     %播放画面
