%**********************************************************
%程序：EX501.M
%功能：擦除方式显示动画实例
%**********************************************************
t=0:0.05:10*pi;                                             %设置t的范围及取值刻度
h=plot(t,sin(2*t).*exp(-t/5), 'EraseMode','xor');   %设置图形属性
set(gcf, 'position',[450,350,350,250],'Menubar','none')  %设置图形属性
for i=1:200                                                    %设置循环条件
y=sin(2*t+i/10).*exp(-t/5)                                %定义函数关系
set(h, 'ydata',y);                                           %设置图形属性
drawnow;                                                        %完成图形动画
end
